sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/tops/top1.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:Top xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLTops/">
            <Type>BLOUSE</Type>
            <Color>332AAF</Color>
            <Size>M</Size>
        </ns2:Top>
    </S:Body>
</S:Envelope>
